import java.util.Scanner;
public class Main {
    public static void main(String[] args) {
        {
            HelloPlayer();
        }
    }
    private static void StartNewGame(){
        Game game = new Game();
        game.Shop();
        game.InformationOfPlayer();
        game.StartGame();
    }

    private static void showCredits(){
        System.out.println("Спасибо за выбор игры Врата Баума!\n" +
                "Разработано: Крупнова Дарья, ИУ3-41Б\n" +
                "Версия 2.0.12\n" +
                "Да прибудет с Вами сила!\n");
    }
    private static void HelloPlayer(){
        System.out.println("     ヾミ::､/:.:.:.:.:.:.:.:＼\n" +
                "　 　 　 ヾ}:.:.:.:.:.:.:.:.＼\n" +
                "　　　　 /:.:.:.:.:.:.:.:.::.ヽ､\n" +
                "　　　／-=:.:.三:.:＿＿＿_:.:.:.＞\n" +
                "　 ＜:.:-=.:.　V ｨ=ミV.ｨ=ﾐV:.彡\n" +
                "　　　 7:( |:.|｛ ﾋ.ｿ　 ﾋｿ }:. |\n" +
                "　　　　ﾚ:ﾊ:|''　　､_, 　 ''从|\n" +
                "　　　　　 Vv＞:rr:r::＜V\n" +
                "　　 　 　 ｲ_):.:./ { |:.:.:ﾍ\n" +
                "　　　　 ｛:.:{{:.:/ : . |:.:.:.:ﾍ､\n" +
                "　　　　　７:.:.:～～:.:.:.:.:.ﾍヽ\n" +
                "　　　　 /:.:.:.:.:.:.:.:.:.:.:.:.V\n" +
                "　　　 ./:.:.:.:.:.:.:.:.:.:.:.:.:_)\n" +
                "　　　 ヽ- ､:＿:.:.:.:.:.＿:. - '\n" +
                "　　　　 　 {::.::.:|￣|::.::.:}\n" +
                "　　　　　　L;;,;｣　 Ｌ;;,;｣\n" +
                "　　　　　　ﾉ:::. 　 |::::\n" +
                "　　　　　 ヽ- ′　　　ヽ-′");
        System.out.println("|-------------------------------------------------------------|\n" +
                           "Привет! Что-то я тебя не припомню...                         \n" +
                           "Ты у нас недавно? Давай расскажу тебе, как тут все устроено?)\n" +
                           "|-------------------------------------------------------------|\n\n" +
                "1. Да, давай\n"+
                "2. Нет, да начнется битва!");
        Scanner scanner = new Scanner(System.in);
        int command;
        do {
            command = scanner.nextInt();
            switch (command){
                case 1:
                    System.out.println("|-----------------------------------------|\n" +
                                       "Ой-ой-ой, как невежливо, совсем забыла!  \n" +
                                       "Как тебя зовут?                          \n" +
                                       "|-----------------------------------------|\n");
                    Scanner Name = new Scanner(System.in);
                    String PlayerName;
                    PlayerName = Name.nextLine();
                    System.out.println("|-----------------------------------------|\n" +
                                       "Что ж, привет," + PlayerName + "\n" +
                                       "Мда, ты явно нездешний                   \n" +
                                       "|-----------------------------------------|\n");
                    System.out.println("|--------------------------------------------------------------------------------|\n" +
                                       "Меня зовут Юи. Я что-то типа местного гида. Хотя, туриство сейчас почти и нет...\n" +
                                       "Добро пожаловать в город Тылета! В тяжелые времена ты тут оказался.\n" +
                                       "Еще совсем недавно город наш процветал, но все когда-то заканчивается.\n" +
                                      "|---------------------------------------------------------------------------------|\n");
                    System.out.println("|--------------------------------------------------------------------------------|\n" +
                                       "Около двух месяцев назад наша мирная жизнь изменилась. На нас напали!\n" +
                                       "Мы прозвали их Черными Рыцарями. Они появились внезапно, за одну ночь.\n" +
                                       "Еще и местный маг укатил куда-то... Так что теперь за городскую черту не выйти\n" +
                                       "без хорошего защитника... Слушай, я вижу у тебя оружие. Не хочешь работенку?)\n" +
                            "|---------------------------------------------------------------------------------|\n");
                    StartMenu();
                    break;
                case 2:
                    StartMenu();
                    break;
                default:
                    System.out.println("Команда не распознана. Пожалуйста, попробуйте снова.");
            }
        }
        while (command != 2);
    }
    public static void StartMenu(){
        Scanner scanner = new Scanner(System.in);
        int command;
        do {
            System.out.println("Добро пожаловать в Врата Баума!! Сделайте свой выбор...");
            System.out.println("1: Начать новую битву");
            System.out.println("2: Опции");
            System.out.println("3: Титры");
            System.out.println("4: Выход");
            command = scanner.nextInt();
            switch (command){
                case 1:
                    StartNewGame();
                    break;
                case 2:
                    OptionsMenu.showOptionsMenu();
                    break;
                case 3:
                    showCredits();
                    StartMenu();
                case 4:
                    System.exit(0);
                    break;
                default:
                    System.out.println("Команда не распознана. Пожалуйста, попробуйте снова.");
            }
        }
        while (command != 4);

    }
}